---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BeamSystemTagInstParamAngle
source: html/8936810f-9df6-40bb-e5cb-1e009d61c42c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BeamSystemTagInstParamAngle Property

"Beam System Tag Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId BeamSystemTagInstParamAngle { get; }
```